# SetTileBackgroundColor

## Description
Sets the specified tile resource's background color.

```pascal
PROCEDURE SetTileBackgroundColor(
				tileHandle      : HANDLE;
				backgroundColor : LONGINT);
```

```python

def vs.SetTileBackgroundColor(tileHandle, backgroundColor):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileHandle|HANDLE|The tile resource in which to set the background color.|
|backgroundColor|LONGINT|The RGB background color to set.|

## Examples
```pascal
SetTileBackgroundColor(tileHandle, backgroundColor);
```

## See Also
VS Functions:
CreateTile| ShowEditTileDialog| ShowEditTileSettingsDialog| ShowNewTileDialog| GetTileGeometryGroup| BeginGroupN| AddTileGeometryObject| GetTileGroupParent| IsTileGroupContainedObject| GetTileBackgroundColor| SetTileBackgroundColor| GetTileRepetitionPoint| SetTileRepetitionPoint| GetTileOffsetPoint| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011
## Category
* Document Attributes